"""
This module contains all dialogues and messages
that will appear during the whole game

"""

import time
from random import choices

def hprint(line):
    """ Друкує речення ніби в лайв режимі(по букві з певним інтервалом) """
    for i in line:
        print(i, end="", flush= True)
        time.sleep(0.07)
    print()

def vstup():
    """ Виводиться з самого початку """
    try:
        hprint("Десь в Україні, 70-ті роки...")
        hprint("*Пройшло все ЗЗО (Зовнішнє Залежне Оцінювання, ми ж в совку), саме час подавати документи*")
        hprint("*** Думки вступника ***")
        hprint("Хм... От і закінчилась школа, потрібно вибрати універ та спеціальність,на якій буду навчатись")
    except KeyboardInterrupt:
        print()

def study_begin():
    """ Виводиться другим, після vstup """
    try:
        hprint("*Мене зарахували в УКУ! Та ще й на Факультет прикладних Наук!*")
        hprint("*Оглянув програму")
        hprint("***Думки вже студента***")
        hprint("Клас! Яка ж цікава програма на мене чекає, скільки різноманітних чисел я вивчу.")
    except KeyboardInterrupt:
        print()

def study_end():
    """ Виводиться третім, після study_begin """
    try:
        hprint("*4 years later*") # Було б класно тут вставити аудіо зі спанч боба або навіть картинку-відео
        hprint("***Думки майже випускника***")
        hprint("Такс, попереду непростенька сесія, проте остання, я точно впораюсь!")
        hprint("Мені варто підготуватись!")
    except KeyboardInterrupt:
        print()

def game_rules():
    """ Виводиться четвертим, після study_end """
    try:
        hprint("Для того, щоб чудово підготуватись, я мушу повторити числа з усіх курсів.")
        hprint("***Напружую весь мозок і згадую, як ми їздили в колгоспи***")
        hprint("Точняк, достатньо згадати кожен курс окремо, і я в шоколаді")
        hprint("*Рекомендація від розробників: краще проходити всі курси, до того ж поступово")
    except KeyboardInterrupt:
        print() #Гадаю, саме ось цей блок з правилами гри скіпати не можна.

def game_start():
    """ Виводиться п'ятим, після game_rules """
    try:
        hprint("Перелік курсів")
        print("Перший курс - парні числа")
        print("Другий курс - вдалі числа")
        print("Третій курс - числа Улама")
        print("Четвертий курс - комбо (салат) з усіх трьох видів чисел")
        print("Оберіть курс")
    except KeyboardInterrupt:
        print()

def even_numbers_start():
    """ виводиться при запуску режиму з парними числами """
    try:
        hprint("Що ж ми вичили на 1 курсі?")
        hprint("А...")
        hprint("Парні числа!")
        hprint("Пам'ятаю як ми їздили в колгосп копати картоплю 🥔.")
        hprint("Нашим куратором був пан Фединяк. Оскільки його улюбленими числами були парні,")
        hprint("ми, його група, викопували картоплю лише під парними номерами.")
        hprint("*** Спогади ***")
        hprint("*** перехід на локацію з полем картоплі ***")
        hprint("Щоб  викопати потрібну картоплю, виберіть зі списку одну парну цифру та запишіть її:")
    except KeyboardInterrupt:
        print()

def even_numbers_win():
    """ Виводиться, якщо гравець виграв в парні числа """
    try:
        hprint("Ура, все-таки я пам'ятаю ці числа.")
        hprint("Не дарма тоді копав.")
    except KeyboardInterrupt:
        print()

def even_numbers_lose():
    """ Виводиться, якщо гравець програв в парні числа """
    try:
        hprint("Напевно мало тоді копав...")
        hprint("Треба повторити.")
    except KeyboardInterrupt:
        print()   

def lucky_number_start():
    """ Виводиться при запуску режиму із вдалими числами """
    try:
        hprint("На другому курсі після лЄкції з кАмбінаторики ми поїхали викопувати моркву 🥕.")
        hprint("На цей раз нашим куратором був пан Щербина.")
        hprint("Його улюбленими числами були вдалі числа.")
        hprint("*** Спогади ***")
        hprint("*** перехід на локацію з полем моркви ***")
        hprint("Щоб  викопати потрібну моркву, виберіть з списку одну вдалу цифру та запишіть її:")
    except KeyboardInterrupt:
        print()

def lucky_number_win():
    """ виводиться, якщо гравець виграв в вдалі числа """
    try:
        hprint("Спочатку зазубрив, а потім")
        hprint("зрозумів використавши практику.")
    except KeyboardInterrupt:
        print()

def lucky_number_lose():
    """ виводиться, якщо гравець програв у вдалі числа """
    try:
        hprint("Виходить, погано зубрив, ще й халтурив у колгоспі...")
    except KeyboardInterrupt:
        print()

def ulam_number_start():
    """ виводиться при запуску режиму з числами Улама """

    try:
        hprint("На 3-тьому курсі ми їздили в колгосп разом з пані Колодій.")
        hprint("Вона любила числа Улама, тому й збирали ми помідори 🍅 під такими числами.")
        hprint("Але ці числа \"такі собі подружки\"... Було важко з ними, треба пригадати.")
        hprint("*** Спогади ***")
        hprint("*** перехід на локацію із плантацією помідорів ***")
        hprint("Щоб  назбирати потрібні помідори, виберіть зі списку одну цифру Улама та запишіть її:")

    except KeyboardInterrupt:
        print()

def ulam_number_win():
    """ виводиться, якщо гравець виграв в числа Улама """

    try:
        hprint("Ура, нарешті все повторив, навіть ці кляті числа Улама.")
    except KeyboardInterrupt:
        print()

def ulam_number_lose():
    """ виводиться, якщо гравець програв у числа Улама """

    try:
        hprint("І то - цифра, і то - цифра, а сума - то вже число Улама. Знову збився...")
        hprint("Треба буде повторити.")
    except KeyboardInterrupt:
        print()

def all_numbers_start():
    """ виводиться при запуску режиму з всіма числами """

    try:
        hprint("*** Екзамен ***")
        hprint("От і настав судний день. Побачимо, на що я здатний.")
        hprint("Сподіваюсь, не просто так стільки часу витратив на навчання.")
        hprint("Ну що, погнали!")
        hprint("*** початок ***")
        hprint("Щоб отримати бал, виберіть зі списку потрібну цифру та запишіть її:")
    except KeyboardInterrupt:
        print()

def all_numbers_win():
    """ виводиться, якщо гравець виграв """

    try:
        hprint("Ура, я випускник УКУ, ще й не провалив екзамен.")
        hprint("Тепер переді мною відкриті двері у всі ІТ компанії світу.")
    except KeyboardInterrupt:
        print()

def all_numbers_lose():
    """ виводиться, якщо гравець програв """

    try:
        hprint("Пан Романюк: Вітаю! ТАЛОН !")
        hprint("Гравець: Oh shit! Here we go again.")
    except KeyboardInterrupt:
        print()

def correct_num() -> str:
    """ виводить, якщо користувач ввів правильне число в ігрі """

    resp_lst = ["Крутяк, так тримати!", "Та я взагалі в цих числах про.", "Щось залегко, треба очі закрити.",\
        "Бааам, ще один бал, хто б сумнівався!?", "- Алло, гугл? Беріть мене на роботу, буду вашим директором!",\
            "Легкотня, можу із закритими очима!", "Нічого собі, сам в шоці, що таке знаю!", "Плюс 100 до самооцінки.",\
                "Геніально!", "Супер, поїхали далі!"]
    resp_lst = choices(resp_lst, k=1)

    hprint(resp_lst[0])

def incorrect_num() -> str:
    """ виводить, якщо користувач ввів неправильне число в ігрі """

    resp_lst = ["Все це дуже розумно, але не зрозуміло...", "Чекай, щооо?? Я помилився!??", "Ну все, приїхали..",\
        "Мінус бал, це ще не кінець світу", "Як я це забув!? Капець", "Як говорять люди: 'Мінус 1 бал - плюс 1 до уважності'.",\
            "Хоч би не програти, а то не засну більше(", "Нехай це залишиться між нами, ок?", "Тільки не плач.",\
                "Буду викладати плитку, буду викладачем! (хоча б так)"]
    resp_lst = choices(resp_lst, k=1)

    hprint(resp_lst[0])

def bingo_plot() -> str:
    """
    """
    try:
        hprint("!!!  TOP SECRET INFORMATION   !!!\n")
        hprint("*** прошарений випускник: ***")
        hprint("Так-так-так-так, значить ти вибрав цей режим...")
        hprint("Це не навчання, а секретна місія! Я тобі даю доступ до неї")
        hprint("АЛЕ, пам'ятай, якщо тебе спалять, ми не бачились, і ми не знайомі")
        hprint("Отже, до справи...")
        hprint("Кожного року викладачі садять картоплю, для нового потоку першачків, щоб вони вчили всі ці числа, розумієш?")
        hprint("Але цього року вони секретно доручили мені, випускнику, це зробити, але я не маю часу")
        hprint("Тому я тебе прошу все посадити за інструкціями, які надам згодом")
        hprint("Якщо ти хоча б один раз помилишся, прийдеться починати спочатку, якщо звичайно стягнеш")
        hprint("Зараз ти повинен таємно пробратись на той колгосп, тримай сумку - в ній потрібні інструкції")
        hprint("До речі, якщо ти все нормально зробиш, то я тобі куплю легендарну котлету в трапезній!")
        hprint("Значить ти знаєш завдання і знаєш яка буде оплата, тож погнав!)")
        hprint("Бережи себе, і не спались!\n")
        hprint("*** успішно пробрвся на колгосп ***")
        hprint("Щоб припахати наступних першачків, розсади картоплю!")
        hprint("*** відкриваю сумку з правилами... ***\n")

    except KeyboardInterrupt:
        print()

def rules(number_of_rule: int) -> str:
    """ Повертає правила ігри в бінго """
    if number_of_rule == 1:
        try:
            print('ПРАВИЛА:')
            hprint('U - сорт картоплі "Число Улама" (Ulam number)')
            hprint('L - сорт картоплі "Вдале число" (Lucky number)')
            hprint('E - сорт картоплі "Парне число" (Even number)')
            hprint('Посади картоплю на правильній грядці.')
            hprint('Для цього посади картоплю на грядку(встав число на місце букви,')
            hprint('яка відповідає потрібному сорту (типу цього числа).')
            print('Як?')
            hprint('Просто введи координати цієї букви, де перша цифра - номер рядка, а друга - номер стовпчика.') 
            hprint('Приклад: 01')
            hprint('Якщо картопля(число) не підходить до жодної грядки (до жодного із запропонованих типів чисел),')
            hprint('залиш її першокурсникам, що прийдуть у наступному році(для цього введи 0 або')
            hprint('будь-які інші символи, що не відповідають координатам грядки).')
        except KeyboardInterrupt:
            print()
    if number_of_rule == 2:
        try:
            print('ПРАВИЛА:')
            hprint('Ти побачиш номери кожної картоплини, яку треба пересадити та вказівку, куди пересадити.')
            hprint('Обери серед усіх картоплин (чисел) лише 3, які підходять для відповідного ряду.')
            hprint('Будь уважним. Кожну картоплину ти можеш пересадити рівно 1 раз.')
            hprint('Тому радимо завчасно прорахувати, як буде виглядати кожен ряд.')
        except KeyboardInterrupt:
            print()

def words_from_bingo_garden(number_of_phrase: int) -> str:
    """ повертає реакції на ввід чисел користувача в ігрі бінго """
    if number_of_phrase == 1:
        print('Ця картоплина не мала рости тут. Ти програв.')
    if number_of_phrase == 2:
        print('На цій грядці вже росте картопля. Обери іншу, будь ласка.')
    if number_of_phrase == 3:
        print('Ехх, картопля в цьому році буде не по сортам рости. Але дякую за роботу!\
Як і домовлялися ти отримаєш котлету із трапезної, заслужив.')
    if number_of_phrase == 4:
        print('Залишив картоплю для першачків, що прийдуть у наступному році?')
    if number_of_phrase == 5:
        print('Щось не виходить у тебе пересадка картоплі. Попрошу когось іншого.')
    if number_of_phrase == 6:
        print('Ти мав використовувати лише картоплю, що вже садив раніше.')
    if number_of_phrase == 7:
        print('Дякую за роботу! Попрошу когось іншого пересадити картоплю.')
    if number_of_phrase == 8:
        print("Гарно попрацював! З мене котлета! Тепер грядки мають такий вигляд: ")