import time
import random
def hprint(line):
    """ Друкує речення ніби в лайв режимі(по букві з певним інтервалом) """
    for i in line:
        print(i, end="", flush= True)
        time.sleep(0.07)
    print()

def vstup():
    """ Виводиться з самого початку """
    try:
        hprint("Десь в Україні, 70-ті роки...")
        hprint("*Пройшло все ЗЗО (Зовнішнє Залежне Оцінювання, ми ж в совку), саме час подавати документи*")
        hprint("*** Думки вступника ***")
        hprint("Хм... От і закінчилась школа,потрібно вибрати Універ та спеціальність,на якій буду навчатись")
    except KeyboardInterrupt:
        print()

def study_begin():
    """ Виводиться другим, після vstup """
    try:
        hprint("*Мене зарахували в УКУ! Та ще й на факультет Прикладних Наук!*")
        hprint("*Оглянув програму")
        hprint("***Думки вже студента***")
        hprint("Клас! Яка ж цікава програма на мене чекає, скільки різноманітних чисел я вчитиму")
    except KeyboardInterrupt:
        print()

def study_end():
    """ Виводиться третім, після study_begin """
    try:
        hprint("*4 years later*") # Було б класно тут вставити аудіо зі спанч боба або навіть картинку-відео
        hprint("***Думки майже випускника***")
        hprint("Такс, попереду непростенька сесія, проте остання, я точно впораюсь!")
        hprint("Мені варто підготуватись!")
    except KeyboardInterrupt:
        print()

def game_rules():
    """ Виводиться четвертим, після study_end """
    try:
        hprint("Для того, щоб чудово підготуватись, я мушу повторити числа з усіх курсів")
        hprint("***Напружую весь мозок і згадую як ми їздили в колгоспи***")
        hprint("Точняк, достатньо згадати кожен курс окремо і я в шоколаді")
        hprint("!!! Рекомендація від розробників: краще проходити всі курси, до того ж поступово !!!")
    except KeyboardInterrupt:
        print() #Гадаю, саме ось цей блок з правилами гри скіпати не можна.

def game_start():
    """ Виводиться п'ятим, після game_rules """
    try:
        hprint("Перелік курсів")
        print("Перший курс - парні числа")
        print("Другий курс - вдалі числа")
        print("Третій курс - числа Улама")
        print("Четвертий курс - комбо (салат) з усіх трьох видів чисел")
        print("Оберіть курс")
    except KeyboardInterrupt:
        print()

def even_numbers_start():
    """ виводиться при запуску режиму з парними числами """
    try:
        hprint("Що ж ми вичили на 1 курсі?")
        hprint("А...")
        hprint("Парні числа!")
        hprint("Пам'ятаю як ми їздили в колгосп копати картоплю.")
        hprint("Нашим куратором був пан Феденяк і оскільки його улюбленими числами були - парні,")
        hprint("то ми(його група) викопували картоплю лише під парними номерами.\n")
        hprint("*** Спогади ***")
        hprint("*** перехід на локацію з полем картоплі ***\n")
        hprint("Щоб  викопати потрібну картоплю виберіть з списку одну парну цифру та запишіть її:")
    except KeyboardInterrupt:
        print()

def even_numbers_win():
    """ Вивводиться, якщо гравеь виграв в парні числа """
    try:
        hprint("Ура, все-таки я пам'ятаю ці числа.")
        hprint("Не зря тоді копав.")
    except KeyboardInterrupt:
        print()

def even_numbers_lose():
    """ Виводиться, якщо гравець програв в парні числа """
    try:
        hprint("Напевно мало тоді копав...")
        hprint("Треба повторити.")
    except KeyboardInterrupt:
        print()   

def happy_number_start():
    """ Виводиться при запуску режиму з вдалими числами """
    try:
        hprint("На другому курсі після лЄкції з кАмбінаторики ми поїхали викопувати моркву.")
        hprint("На цей раз нашим куратором був пан Щербина.")
        hprint("Його улюбленими числами були вдалі числа.\n")
        hprint("*** Спогади ***")
        hprint("*** перехід на локацію з полем моркви ***\n")
        hprint("Щоб  викопати потрібну моркву виберіть з списку одну вдалу цифру та запишіть її:")
    except KeyboardInterrupt:
        print()

def happy_number_win():
    """ виводиться, якщо гравець виграв в вдалі числа """
    try:
        hprint("Спочатку зазубрив, а потім")
        hprint("зрозумів використавши практику.")
    except KeyboardInterrupt:
        print()

def happy_number_lose():
    """ виводиться, якщо гравець програв в вдалі числа """
    try:
        hprint("Виходить погано зубрив, ще й халтурив на колгоспі...")
    except KeyboardInterrupt:
        print()

def ulam_number_start():
    """ виводиться при запуску режиму з числами улама """

    try:
        hprint("На 3-тьому курсі ми їздили в колгосп разом з пані Колодій.")
        hprint("Вона любила числа Улама, тому й викопували ми помідори під такими числами.")
        hprint("Але ці числа \"такі собі подружки\"... Було важко з ними, треба пригадати\n")
        hprint("*** Спогади ***")
        hprint("*** перехід на локацію з полем помідори ***\n")
        hprint("Щоб  назбирати потрібні помідори виберіть з списку одну цифру Улама та запишіть її:")

    except KeyboardInterrupt:
        print()

def ulam_number_win():
    """ виводиться, якщо гравець виграв в числа Улама """

    try:
        hprint("Ура нарешті все повторив, навіть ці кляті числа Улама.")
    except KeyboardInterrupt:
        print()

def ulam_number_lose():
    """ виводиться, якщо гравець програв в вдалі числа """

    try:
        hprint("І то - цифра, і то - цифра, а сума то вже число Улама. Знову збився...")
        hprint("Треба буде повторити.")
    except KeyboardInterrupt:
        print()

def all_numbers_start():
    """ виводиться при запуску режиму з всіма числами """

    try:
        hprint("*** Екзамен ***")
        hprint("От і настав судний день. Побачимо на що я здатний.")
        hprint("Надіюсь не просто так стільки часу витратив на це все.")
        hprint("Ну що, погнали!\n")
        hprint("*** початок ***\n")
        hprint("Щоб отримати бал, виберіть з списку потрібну цифру та запишіть її:")
    except KeyboardInterrupt:
        print()

def all_numbers_win():
    """ виводиться, якщо гравець виграв """

    try:
        hprint("Ура, я випускник УКУ, ще й не провалив екзамен.")
        hprint("Тепер передімною відкриті двері у всі ІТ компанії.")
        hprint("До того я вже знаю різні числа, тому точно буду мегамозгом серед інших!")
        hprint("Плюс я експерт з викопування овочів, капець, та я геній просто!")
    except KeyboardInterrupt:
        print()

def all_numbers_lose():
    """ виводиться, якщо гравець програв """

    try:
        hprint("Пан Романюк: Вітаю! ТАЛОН !")
        hprint("Гравець: Oh shit! Here we go again.")
    except KeyboardInterrupt:
        print()

def correct_num() -> str:
    """ виводить, якщо користувач ввів правильне число в ігрі """

    resp_lst = ["Крутяк, так тримати!", "Та я взагалі в цих числах про", "Щось залегко, треба очі закрити",\
        "Бааам, ще один бал, хто б сумнівався!?", "- Алло, гугл? Беріть мене на роботу, буду вашим директором!",\
            "Легкотня, можу із закритими очима!", "Нічого собі, сам в шоці, що таке знаю!", "Плюс 100 до самооцінки",\
                "Геніально!", "Супер, поїхали далі!"]
    resp_str = random.choices(resp_lst, k=1)

    return hprint(resp_str[0])


def incorrect_num() -> str:
    """ виводить, якщо користувач ввів неправильне число в ігрі """

    resp_lst = ["все це дуже розумно, але не зрозуміло...", "чекай, щооо?? Я помилився!??", "Ну все, приїхали..",\
        "Мінус бал, це ще не кінець світу", "Як я це забув!? Капець", "Як говорять люди: мінус 1 бал, плюс 1 до уважності",\
            "Хоч би не програти, а то не засну більше(", "Нехай це залишеться між нами, ок?", "Тільки не плач",\
                "Буду викладати плитку, буду викладачем! (хоча б так)"]
    resp_str = random.choices(resp_lst, k=1)

    return hprint(resp_str[0])
